#+STARTUP: content
#+OPTIONS: num:nil author:nil
#+TAGS: audio(a) video(v) image(i)


* audio duration

file name and audio duration

#+NAME: duration
#+HEADER: :dir "intro/audio/original"
#+HEADER: :var file="1-ffmpeg-github.wav"
#+BEGIN_SRC sh :async t
ffprobe -v error \
-show_entries \
format=filename,duration \
-pretty \
-sexagesimal \
-of csv=p=0 \
-i "${file}"
#+END_SRC

#+RESULTS: duration
| 1-ffmpeg-github.wav | 0:00:27.120907 |

* audio duration and find

file name and audio duration

use execdir with find to avoid a ./ prefix on the filename results
csv=p=0 removes the format comlumn

#+NAME: duration-find
#+HEADER: :dir "intro/audio/original"
#+BEGIN_SRC sh :async t
find -s . -type f -name "*.wav" -execdir sh -c \
'ffprobe -v error \
-show_entries \
format=filename,duration \
-pretty \
-sexagesimal \
-of csv=p=0 \
-i "${0}"' \
"{}" \;
#+END_SRC

#+RESULTS: duration-find
| 01-ffmpeg-github.wav     | 0:00:27.120907 |
| 02-audio-silence.wav     | 0:00:40.309841 |
| 03-combine-clips.wav     | 0:00:34.737052 |
| 04-curve2ffmpeg.wav      | 0:00:25.077551 |
| 05-correct-clip.wav      | 0:00:26.377868 |
| 06-ebu-meter.wav         | 0:00:19.876281 |
| 07-extract-frame.wav     | 0:00:28.606984 |
| 08-fade-clip.wav         | 0:00:23.034195 |
| 09-fade-normalize.wav    | 0:00:36.780408 |
| 10-fade-title.wav        | 0:00:54.056054 |
| 11-img2video.wav         | 0:00:23.034195 |
| 12-loudnorm.wav          | 0:00:18.018685 |
| 13-normalize.wav         | 0:00:19.876281 |
| 14-overlay-clip.wav      | 0:00:32.136417 |
| 15-subs2transcript.wav   | 0:00:21.176599 |
| 16-subtitle-add.wav      | 0:00:24.706032 |
| 17-trim-clip.wav         | 0:00:33.622494 |
| 18-waveform.wav          | 0:00:20.805079 |
| 19-xfade-clips.wav       | 0:00:31.393379 |
| 20-zoompan.wav           | 0:00:41.610159 |
| 21-bin-dir.wav           | 0:00:21.548118 |
| 22-source-shell.wav      | 0:00:29.164263 |
| 23-git-clone.wav         | 0:00:26.377868 |
| 24-copy-scipts.wav       | 0:00:13.931973 |
| 25-xcode-commandline.wav | 0:00:26.006349 |
| 26-homebrew.wav          | 0:00:14.675011 |
| 27-ffmpeg-install.wav    | 0:00:30.464580 |
| eb1.wav                  | 0:00:18.390204 |

* gps from video

extract gps stats from a video

#+NAME: gps
#+HEADER: :var file="infile.mov"
#+BEGIN_SRC sh 
exiftool -n -gpslatitude -gpslongitude -ee "${file}" -csv
#+END_SRC

#+RESULTS: gps
| SourceFile | GPSLatitude | GPSLongitude |
| infile.mov |     51.5236 |      -0.1124 |

* video duration

#+NAME: duration
#+HEADER: :var file="infile.mov"
#+BEGIN_SRC sh 
ffprobe -v error -show_entries format=duration -sexagesimal -of default=noprint_wrappers=1:nokey=1 "${file}"
#+END_SRC

#+RESULTS: duration
: 0:05:27.060000

* video stats

#+NAME: vduration
#+HEADER: :var file="infile.mov"
#+BEGIN_SRC sh 
ffprobe -v error \
-show_entries \
format=filename,duration,size,bit_rate:\
format_tags=creation_time,com.apple.quicktime.location.ISO6709:\
stream=codec_name,codec_type,profile,bit_rate,width,height,sample_rate,channel_layout \
-pretty \
-sexagesimal \
-of csv \
-i "${file}"
#+END_SRC

#+RESULTS: vduration
| stream | h264       | High           | video             | 1920             | 1080                        | 15.364076 Mbit/s           |
| stream | aac        | LC             | audio             | 44.100000 KHz    | mono                        | 100.796000 Kbit/s          |
| stream | unknown    | unknown        | data              | 17.525000 Kbit/s |                             |                            |
| stream | unknown    | unknown        | data              | N/A              |                             |                            |
| format | infile.mov | 0:05:27.060000 | 603.980409 Mibyte | 15.491209 Mbit/s | 2019-11-19T19:31:51.000000Z | +51.5236-000.1124+015.798/ |

* waveform from video pass block
:PROPERTIES:
:header-args: :dir ~/Desktop/test/
:END:

use properties to set a dir
list video files in a directory

#+NAME: list
#+BEGIN_SRC sh
ls 
#+END_SRC

#+RESULTS: list
: infile.mov

extract a waveform from the video

#+NAME: waveform
#+HEADER: :var file=list
#+HEADER: :results file :file "waveform.png" :exports results
#+BEGIN_SRC sh
ffmpeg \
-hide_banner \
-stats -v panic \
-i "${file}" \
-filter_complex "aformat=channel_layouts=mono,showwavespic=s=1000x200" \
-frames:v 1 \
-f apng -
#+END_SRC

#+RESULTS: waveform

* tramp session

#+NAME: connect
#+HEADER: :dir /ssh:macmini:
#+BEGIN_SRC sh :session macmini
ssh macmini
#+END_SRC

#+RESULTS: connect

#+NAME: tramptest
#+BEGIN_SRC sh :session macmini
ls ~/Desktop
#+END_SRC

#+RESULTS: tramptest
| Literate-Devops-with-Emacsg.mp4 | siteground-ftp.txt |

